# <font color=Black>  Pandas Revision  </font>

***

## Lesson 1 : Reading data

In [1]:
import pandas as pd

###  <font color=DarkGreen> read_table </font>

In [2]:
# putting data in tabular format
dataframe_object = pd.read_table('http://bit.ly/chiporders')

<font color=darkred> **NOTE:** </font>

**read_table** is used to read url links, 
it's **deprecated** which means newer python versions did not support this feature

In [3]:
# printing the dataframe by calling its name
dataframe_object

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98
...,...,...,...,...,...
4617,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Sour ...",$11.75
4618,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Sour Cream, Cheese...",$11.75
4619,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$11.25
4620,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Lettu...",$8.75
4621,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$8.75

### <font color = 'darkgreen'> Col header

In [4]:
# reading more complicated files
# creat a list that contains col names0
col_names = ['User ID', 'Age', 'Gender','Occupation', 'Zip code']
data = pd.read_csv('https://bit.ly/movieusers', sep = '|', header = None, names = col_names)
data.head()

   User ID  Age Gender  Occupation Zip code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

<font color=darkred> **NOTE:** </font>

the default seprator for read_table is **tab** 

if our data has another seprator then we should use **Sep** parameter

if our data doesnt have a header then we should set **header** parameter to **None**

we can set a header by passing a list to **names** parameters

## Lesson 1 Bonus !

###  <font color=DarkGreen> Skiprows </font>

In [5]:
# skipping the first two rows
data = pd.read_csv('https://bit.ly/movieusers', skiprows =2, sep = '|', header = None)
data.head()

   0   1  2              3      4
0  3  23  M         writer  32067
1  4  24  M     technician  43537
2  5  33  F          other  15213
3  6  42  M      executive  98101
4  7  57  M  administrator  91344

In [6]:
# skipping rpws with index number 0 , 2 and 4
data = pd.read_csv('https://bit.ly/movieusers', skiprows = [0,2,4], sep = '|', header = None )
data.head()

   0   1  2              3      4
0  2  53  F          other  94043
1  4  24  M     technician  43537
2  6  42  M      executive  98101
3  7  57  M  administrator  91344
4  8  36  M  administrator  05201

<font color=darkred> **NOTE:** </font>

we use **skiprows** parameter to avoid displaying specific rows

***

## Lesson 2 : Selecting series from dataframe

#### Series Definition
a one-dimensional object that can hold any data type such as integers, floats and strings (a single column)

In [7]:
# reading file from the web using csv (default seprator is comma)
ufo = pd.read_csv('https://bit.ly/uforeports')
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

###  <font color=DarkGreen> Selecting cols

In [8]:
# Selecting a series (single col)
ufo['City']

0                      Ithaca
1                 Willingboro
2                     Holyoke
3                     Abilene
4        New York Worlds Fair
                 ...
18236              Grant Park
18237             Spirit Lake
18238             Eagle River
18239             Eagle River
18240                    Ybor
Name: City, Length: 18241, dtype: object

In [9]:
# Another way to select a single col
ufo.City

0                      Ithaca
1                 Willingboro
2                     Holyoke
3                     Abilene
4        New York Worlds Fair
                 ...
18236              Grant Park
18237             Spirit Lake
18238             Eagle River
18239             Eagle River
18240                    Ybor
Name: City, Length: 18241, dtype: object

<font color=darkred> **NOTE:** </font>
 
if the series has a space or share the same name as a built in function then the second method will not work well, so we need to use the first one 

**Example:** ufo['Colors Reported']  ufo['shape']

## Lesson 2 Bonus !

###  <font color=DarkGreen> Merging cols </font>

In [10]:
# creting a new col by merging two cols with eachothers
ufo['Location'] = ufo.City + ' , ' + ufo.State
ufo.head()

,City,Colors Reported,Shape Reported,State,Time,Location
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00,"Ithaca , NY"
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00,"Willingboro , NJ"
2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00,"Holyoke , CO"
3,Abilene,NaN,DISK,KS,6/1/1931 13:00,"Abilene , KS"
4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00,"New York Worlds Fair , NY"

<font color=darkred> **NOTE:** </font>

if we want to create a **new col** we Should use brackets and single qoutation marks

***

## Lesson 3 : Commands Parantheses

In [11]:
# reading csv files
movies = pd.read_csv('http://bit.ly/imdbratings')
movies.head()

,star_rating,title,content_rating,genre,duration,actors_list
0,9.3,The Shawshank Redemption,R,Crime,142,"[u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt..."
1,9.2,The Godfather,R,Crime,175,"[u'Marlon Brando', u'Al Pacino', u'James Caan']"
2,9.1,The Godfather: Part II,R,Crime,200,"[u'Al Pacino', u'Robert De Niro', u'Robert Duv..."
3,9.0,The Dark Knight,PG-13,Action,152,"[u'Christian Bale', u'Heath Ledger', u'Aaron E..."
4,8.9,Pulp Fiction,R,Crime,154,"[u'John Travolta', u'Uma Thurman', u'Samuel L...."

In [12]:
movies.shape

(979, 6)

<font color=darkred> **NOTE:** </font>

in general we use parantheses for methods (actions) , we dont use them when we use attributes (descriptions)

***

## Lesson 4: Renaming / deleting cols in dataframe

In [13]:
# displaying cols names
ufo.columns

Index(['City', 'Colors Reported', 'Shape Reported', 'State', 'Time',
       'Location'],
      dtype='object')

###  <font color=DarkGreen> Replace

In [14]:
# replacing spaces in cols names by underscores
ufo.columns.str.replace(' ', '_')

Index(['City', 'Colors_Reported', 'Shape_Reported', 'State', 'Time',
       'Location'],
      dtype='object')

###  <font color=DarkGreen> Drop

In [15]:
# deleting a col
ufo.drop('Colors Reported', axis = 1)

,City,Shape Reported,State,Time,Location
0,Ithaca,TRIANGLE,NY,6/1/1930 22:00,"Ithaca , NY"
1,Willingboro,OTHER,NJ,6/30/1930 20:00,"Willingboro , NJ"
2,Holyoke,OVAL,CO,2/15/1931 14:00,"Holyoke , CO"
3,Abilene,DISK,KS,6/1/1931 13:00,"Abilene , KS"
4,New York Worlds Fair,LIGHT,NY,4/18/1933 19:00,"New York Worlds Fair , NY"
...,...,...,...,...,...
18236,Grant Park,TRIANGLE,IL,12/31/2000 23:00,"Grant Park , IL"
18237,Spirit Lake,DISK,IA,12/31/2000 23:00,"Spirit Lake , IA"
18238,Eagle River,NaN,WI,12/31/2000 23:45,"Eagle River , WI"
18239,Eagle River,LIGHT,WI,12/31/2000 23:45,"Eagle River , WI"
18240,Ybor,OVAL,FL,12/31/2000 23:59,"Ybor , FL"

In [16]:
# deleting multiple cols
ufo.drop(['City', 'Time'], axis = 1)

      Colors Reported Shape Reported State                   Location
0                 NaN       TRIANGLE    NY                Ithaca , NY
1                 NaN          OTHER    NJ           Willingboro , NJ
2                 NaN           OVAL    CO               Holyoke , CO
3                 NaN           DISK    KS               Abilene , KS
4                 NaN          LIGHT    NY  New York Worlds Fair , NY
...               ...            ...   ...                        ...
18236             NaN       TRIANGLE    IL            Grant Park , IL
18237             NaN           DISK    IA           Spirit Lake , IA
18238             NaN            NaN    WI           Eagle River , WI
18239             RED          LIGHT    WI           Eagle River , WI
18240             NaN           OVAL    FL                  Ybor , FL

[18241 rows x 4 columns]

In [17]:
ufo.head()

,City,Colors Reported,Shape Reported,State,Time,Location
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00,"Ithaca , NY"
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00,"Willingboro , NJ"
2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00,"Holyoke , CO"
3,Abilene,NaN,DISK,KS,6/1/1931 13:00,"Abilene , KS"
4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00,"New York Worlds Fair , NY"

## Lesson 4 Bonus !

In [18]:
# deleting specific rows by passing index name
ufo.drop([2,4], axis = 0, inplace= True)

<font color=darkred> **NOTE:** </font>

when **axis = 0** pandas consiedr it as a row, if it's **1** then it's a col.

***

## Lesson 5: Sorting dataframes and series

###  <font color=DarkGreen> Sort_values

In [19]:
# sorting table by the highest rates
movies.sort_values('star_rating' , ascending = False)

,star_rating,title,content_rating,genre,duration,actors_list
0,9.3,The Shawshank Redemption,R,Crime,142,"[u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt..."
1,9.2,The Godfather,R,Crime,175,"[u'Marlon Brando', u'Al Pacino', u'James Caan']"
2,9.1,The Godfather: Part II,R,Crime,200,"[u'Al Pacino', u'Robert De Niro', u'Robert Duv..."
3,9.0,The Dark Knight,PG-13,Action,152,"[u'Christian Bale', u'Heath Ledger', u'Aaron E..."
4,8.9,Pulp Fiction,R,Crime,154,"[u'John Travolta', u'Uma Thurman', u'Samuel L...."
...,...,...,...,...,...,...
948,7.4,Frances Ha,R,Comedy,86,"[u'Greta Gerwig', u'Mickey Sumner', u'Adam Dri..."
949,7.4,Home Alone,PG,Comedy,103,"[u'Macaulay Culkin', u'Joe Pesci', u'Daniel St..."
950,7.4,Bound,R,Crime,108,"[u'Jennifer Tilly', u'Gina Gershon', u'Joe Pan..."
951,7.4,Sleepy Hollow,R,Drama,105,"[u'Johnny Depp', u'Christina Ricci', u'Miranda..."
978,7.4,Wall Street,R,Crime,126,"[u'Charlie Sheen', u'Michael Douglas', u'Tamar..."

<font color=darkred> **NOTE:** </font>

**by default pandas sorts values ascendingly** (start from the lowest value up to the highst one)

***

## Lesson 6: Filtering dataframes

In [20]:
# filtering dataframe by a series (a single col)
movies[movies.duration >= 200]

,star_rating,title,content_rating,genre,duration,actors_list
2,9.1,The Godfather: Part II,R,Crime,200,"[u'Al Pacino', u'Robert De Niro', u'Robert Duv..."
7,8.9,The Lord of the Rings: The Return of the King,PG-13,Adventure,201,"[u'Elijah Wood', u'Viggo Mortensen', u'Ian McK..."
17,8.7,Seven Samurai,UNRATED,Drama,207,"[u'Toshir\xf4 Mifune', u'Takashi Shimura', u'K..."
78,8.4,Once Upon a Time in America,R,Crime,229,"[u'Robert De Niro', u'James Woods', u'Elizabet..."
85,8.4,Lawrence of Arabia,PG,Adventure,216,"[u""Peter O'Toole"", u'Alec Guinness', u'Anthony..."
142,8.3,Lagaan: Once Upon a Time in India,PG,Adventure,224,"[u'Aamir Khan', u'Gracy Singh', u'Rachel Shell..."
157,8.2,Gone with the Wind,G,Drama,238,"[u'Clark Gable', u'Vivien Leigh', u'Thomas Mit..."
204,8.1,Ben-Hur,G,Adventure,212,"[u'Charlton Heston', u'Jack Hawkins', u'Stephe..."
445,7.9,The Ten Commandments,APPROVED,Adventure,220,"[u'Charlton Heston', u'Yul Brynner', u'Anne Ba..."
476,7.8,Hamlet,PG-13,Drama,242,"[u'Kenneth Branagh', u'Julie Christie', u'Dere..."
630,7.7,Malcolm X,PG-13,Biography,202,"[u'Denzel Washington', u'Angela Bassett', u'De..."
767,7.6,"It's a Mad, Mad, Mad, Mad World",APPROVED,Action,205,"[u'Spencer Tracy', u'Milton Berle', u'Ethel Me..."

<font color=darkred> **NOTE:** </font>
    
inside the brackets we specify the col name as follow df.colname

using this method we deisplay the whole filtered dataframe

here we filter the rows only

## Lesson 6 Bonus !

###  <font color=DarkGreen> Loc

In [21]:
# filtering genre col by duration 
movies.loc[movies.duration >= 200, 'genre']

2          Crime
7      Adventure
17         Drama
78         Crime
85     Adventure
142    Adventure
157        Drama
204    Adventure
445    Adventure
476        Drama
630    Biography
767       Action
Name: genre, dtype: object

<font color=darkred> **NOTE:** </font>

if we want to filter a specific col by another col

in this case, we filtered movies genre in which movies duration is longer than 200 minutes

filtering the dataframe by a certain condition then pulling out a specific col (genre)

***

## Lesson 7: Handeling missing values

###  <font color=DarkGreen> Is null

In [22]:
# showing null values
ufo.isnull()

        City  Colors Reported  Shape Reported  State   Time  Location
0      False             True           False  False  False     False
1      False             True           False  False  False     False
3      False             True           False  False  False     False
5      False             True           False  False  False     False
6      False             True           False  False  False     False
...      ...              ...             ...    ...    ...       ...
18236  False             True           False  False  False     False
18237  False             True           False  False  False     False
18238  False             True            True  False  False     False
18239  False            False           False  False  False     False
18240  False             True           False  False  False     False

[18239 rows x 6 columns]

In [23]:
# counting null values in each col
ufo.isnull().sum()

City                  25
Colors Reported    15357
Shape Reported      2644
State                  0
Time                   0
Location              25
dtype: int64

In [24]:
# displaying all null rows content_rating col
ufo[ufo.Location.isnull()]

      City Colors Reported Shape Reported State              Time Location
21     NaN             NaN            NaN    LA    8/15/1943 0:00      NaN
22     NaN             NaN          LIGHT    LA    8/15/1943 0:00      NaN
204    NaN             NaN           DISK    CA   7/15/1952 12:30      NaN
241    NaN            BLUE           DISK    MT    7/4/1953 14:00      NaN
613    NaN             NaN           DISK    NV    7/1/1960 12:00      NaN
1877   NaN          YELLOW         CIRCLE    AZ    8/15/1969 1:00      NaN
2013   NaN             NaN            NaN    NH     8/1/1970 9:30      NaN
2546   NaN             NaN       FIREBALL    OH  10/25/1973 23:30      NaN
3123   NaN             RED       TRIANGLE    WV  11/25/1975 23:00      NaN
4736   NaN             NaN         SPHERE    CA   6/23/1982 23:00      NaN
5269   NaN             NaN            NaN    AZ   6/30/1985 21:30      NaN
6735   NaN             NaN      FORMATION    TX     4/1/1992 2:00      NaN
7208   NaN             NaN         CIRCLE    MI   10/4/1993 17:30      NaN
8828   NaN             NaN       TRIANGLE    WA  10/30/1995 21:30      NaN
8967   NaN             NaN        VARIOUS    CA   12/8/1995 18:00      NaN
9273   NaN             NaN       TRIANGLE    OH     5/1/1996 3:00      NaN
9388   NaN             NaN           OVAL    CA   6/12/1996 12:00      NaN
9587   NaN             NaN            EGG    FL   8/24/1996 15:00      NaN
10399  NaN             NaN       TRIANGLE    IL   6/15/1997 23:00      NaN
11625  NaN             NaN         CIRCLE    TX     6/7/1998 7:00      NaN
12441  NaN             RED       FIREBALL    WA  10/26/1998 17:58      NaN
15767  NaN             NaN      RECTANGLE    NV   1/21/2000 11:30      NaN
15812  NaN             NaN          LIGHT    NV     2/2/2000 3:00      NaN
16054  NaN           GREEN            NaN    FL    3/11/2000 3:30      NaN
16608  NaN             NaN         SPHERE    NY   6/15/2000 15:00      NaN

###  <font color=DarkGreen> Shape

In [25]:
# printing out the number of rows and cols of ufo dataframe
ufo.shape

(18239, 6)

###  <font color=DarkGreen> Dropna

In [26]:
# dropping rows if any of the col conatins null value
ufo.dropna(how = 'any').shape

(2486, 6)

In [27]:
# dropping rows, if all cols are empty at the same time 
ufo.dropna(how='all').shape

(18239, 6)

In [28]:
# dropping rows, if any of the two cols contains null value 
ufo.dropna(subset = ['Shape Reported', 'Location'], how ='any').shape

(15574, 6)

###  <font color=DarkGreen> Value_counts

In [29]:
# counting the frequency of each row in Shape col
ufo['Shape Reported'].value_counts()

LIGHT        2802
DISK         2122
TRIANGLE     1889
OTHER        1402
CIRCLE       1365
SPHERE       1054
FIREBALL     1039
OVAL          844
CIGAR         617
FORMATION     434
VARIOUS       333
RECTANGLE     303
CYLINDER      294
CHEVRON       248
DIAMOND       234
EGG           197
FLASH         188
TEARDROP      119
CONE           60
CROSS          36
DELTA           7
CRESCENT        2
ROUND           2
FLARE           1
DOME            1
HEXAGON         1
PYRAMID         1
Name: Shape Reported, dtype: int64

In [30]:
# counting the frequency of each value in genre col
movies['genre'].value_counts()

Drama        278
Comedy       156
Action       136
Crime        124
Biography     77
Adventure     75
Animation     62
Horror        29
Mystery       16
Western        9
Sci-Fi         5
Thriller       5
Film-Noir      3
Family         2
History        1
Fantasy        1
Name: genre, dtype: int64

## Lesson 6 Bonus !

###  <font color=DarkGreen> Fillna

In [31]:
ufo['Location'].fillna(value = 'Saudi Arabia', inplace =True)

In [32]:
ufo['Location'].value_counts()

Seattle , WA          187
New York City , NY    161
Phoenix , AZ          136
Houston , TX          108
Las Vegas , NV        102
                     ...
Sloatsburg , NY         1
Port Chester , NY       1
Parlin , NJ             1
Fort Scott , KS         1
Tully , NY              1
Name: Location, Length: 8028, dtype: int64

***

## Lesson 8: Index

#### Purpose of index:

- Identifcation

- Selection 

- Alignment

In [33]:
drinks = pd.read_csv('http://bit.ly/drinksbycountry')

In [34]:
drinks.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa

### <font color ='darkgreen'> Identification

In [35]:
# filtering continent col
drinks[drinks.continent == 'South America']

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
6,Argentina,193,25,221,8.3,South America
20,Bolivia,167,41,8,3.8,South America
23,Brazil,245,145,16,7.2,South America
35,Chile,130,124,172,7.6,South America
37,Colombia,159,76,3,4.2,South America
52,Ecuador,162,74,3,4.2,South America
72,Guyana,93,302,1,7.1,South America
132,Paraguay,213,117,74,7.3,South America
133,Peru,163,160,21,6.1,South America
163,Suriname,128,178,7,5.6,South America
185,Uruguay,115,35,220,6.6,South America
188,Venezuela,333,100,3,7.7,South America

<font color=darkred> **NOTE:** </font>

As mentioned index is used for identification even if we filter the dataframe the index will stay the same (it works as an id for the row)

***

## Lesson 9: Selecting multiple rows and cols

### <font color ='darkgreen'> Loc

In [36]:
# selectig labelled rows and cols [rows, cols]
ufo.loc[[0,1,2], :]

C:\Users\ALELIWN\AppData\Local\Continuum\anaconda3\lib\site-packages\pandas\core\indexing.py:1418: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#deprecate-loc-reindex-listlike
  return self._getitem_tuple(key)

,City,Colors Reported,Shape Reported,State,Time,Location
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00,"Ithaca , NY"
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00,"Willingboro , NJ"
2,NaN,NaN,NaN,NaN,NaN,NaN

In [37]:
# selecting row number one with all cols
ufo.loc[0, :]

City                       Ithaca
Colors Reported               NaN
Shape Reported           TRIANGLE
State                          NY
Time               6/1/1930 22:00
Location              Ithaca , NY
Name: 0, dtype: object

***

### <font color = 'Darkgreen'> Inplace </font>

used when we want to change the dataset not just in the excution time